GrumpyOldPizza/arduino-STM32L4/system/STM32L4xx/Include/dosfs_port.h
/*
 * Copyright (c) 2014 Thomas Roell.  All rights reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to
 * deal with the Software without restriction, including without limitation the
 * rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 *  1. Redistributions of source code must retain the above copyright notice,
 *     this list of conditions and the following disclaimers.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimers in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of Thomas Roell, nor the names of its contributors
 *     may be used to endorse or promote products derived from this Software
 *     without specific prior written permission.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
 * CONTRIBUTORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * WITH THE SOFTWARE.
 */

#if !defined(_DOSFS_PORT_h)
#define _DOSFS_PORT_h

#include "stm32l4_rtc.h"

#ifdef __cplusplus
 extern "C" {
#endif

extern bool     stm32l4_sdcard_spi_init(dosfs_sdcard_t *sdcard);
extern bool     stm32l4_sdcard_spi_present(dosfs_sdcard_t *sdcard);
extern uint32_t stm32l4_sdcard_spi_mode(dosfs_sdcard_t *sdcard, int mode);
extern void     stm32l4_sdcard_spi_select(dosfs_sdcard_t *sdcard);
extern void     stm32l4_sdcard_spi_deselect(dosfs_sdcard_t *sdcard);
extern void     stm32l4_sdcard_spi_send(dosfs_sdcard_t *sdcard, uint8_t data);
extern uint8_t  stm32l4_sdcard_spi_receive(dosfs_sdcard_t *sdcard);
extern void     stm32l4_sdcard_spi_send_data(dosfs_sdcard_t *sdcard, const uint8_t *data, uint32_t count);
extern uint32_t stm32l4_sdcard_spi_receive_data(dosfs_sdcard_t *sdcard, uint8_t *data, uint32_t count);

static inline void stm32l4_system_timedate(uint16_t *p_time, uint16_t *p_date)
{
    stm32l4_rtc_time_t rtc_time;

    stm32l4_rtc_get_time(&rtc_time);

    *p_time = ((rtc_time.second >> 1) | (rtc_time.minute << 5) | (rtc_time.hour << 11));
    *p_date = ((rtc_time.day << 0) | (rtc_time.month << 5) | ((rtc_time.year + 20) << 9));
}

#define DOSFS_PORT_SDCARD_SPI_INIT(_sdcard)                         stm32l4_sdcard_spi_init((_sdcard))
#define DOSFS_PORT_SDCARD_SPI_PRESENT(_sdcard)                      stm32l4_sdcard_spi_present((_sdcard))
#define DOSFS_PORT_SDCARD_SPI_MODE(_sdcard, _mode)                  stm32l4_sdcard_spi_mode((_sdcard), (_mode))
#define DOSFS_PORT_SDCARD_SPI_SELECT(_sdcard)                       stm32l4_sdcard_spi_select((_sdcard))
#define DOSFS_PORT_SDCARD_SPI_DESELECT(_sdcard)                     stm32l4_sdcard_spi_deselect((_sdcard))
#define DOSFS_PORT_SDCARD_SPI_SEND(_sdcard, _data)                  stm32l4_sdcard_spi_send((_sdcard), (_data))
#define DOSFS_PORT_SDCARD_SPI_RECEIVE(_sdcard)                      stm32l4_sdcard_spi_receive((_sdcard))
#define DOSFS_PORT_SDCARD_SPI_SEND_DATA(_sdcard, _data, _count)     stm32l4_sdcard_spi_send_data((_sdcard), (_data), (_count))
#define DOSFS_PORT_SDCARD_SPI_RECEIVE_DATA(_sdcard, _data, _count)  stm32l4_sdcard_spi_receive_data((_sdcard), (_data), (_count))

#define DOSFS_PORT_CORE_TIMEDATE(_ctime, _cdata)             stm32l4_rtc_timedate((_ctime),(_cdate))

#ifdef __cplusplus
}
#endif

#endif /* _DOSFS_PORT_h */
